### Pandas: merge con 3 dataframes

In [1]:
import pandas as pd

In [2]:
dfPedidos = pd.read_csv("../ficheros_curso/merge/Pedidos.txt", sep=';')
dfPedidos.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [3]:
dfEmpresas = pd.read_csv("../ficheros_curso/merge/Empresas.txt", sep=";")
dfEmpresas.head()

   id           empresa
0   1    Speedy Express
1   2    United Package
2   3  Federal Shipping

In [4]:
dfEmpleados = pd.read_csv("../ficheros_curso/merge/Empleados.txt",sep=';')
dfEmpleados.head()

   id     nombre                     cargo
0   1    Davolio   Representante de ventas
1   2     Fuller  Vicepresidente comercial
2   3  Leverling   Representante de ventas
3   4    Peacock   Representante de ventas
4   5   Buchanan         Gerente de ventas

In [5]:
dfTotal = pd.merge(dfEmpleados, dfPedidos, left_on='id', right_on="idempleado")
dfTotal.head()

,id,nombre,cargo,idpedido,cliente,idempleado,idempresa,importe,pais
0,1,Davolio,Representante de ventas,10258,ERNSH,1,1,140.51,Austria
1,1,Davolio,Representante de ventas,10270,WARTH,1,1,136.54,Finlandia
2,1,Davolio,Representante de ventas,10275,MAGAA,1,1,26.93,Italia
3,1,Davolio,Representante de ventas,10285,QUICK,1,2,76.83,Alemania
4,1,Davolio,Representante de ventas,10292,TRADH,1,2,1.35,Brasil

In [6]:
dfTotal = dfTotal.merge(dfEmpresas, left_on="idempresa", right_on="id")
dfTotal.head()

,id_x,nombre,cargo,idpedido,cliente,idempleado,idempresa,importe,pais,id_y,empresa
0,1,Davolio,Representante de ventas,10258,ERNSH,1,1,140.51,Austria,1,Speedy Express
1,1,Davolio,Representante de ventas,10270,WARTH,1,1,136.54,Finlandia,1,Speedy Express
2,1,Davolio,Representante de ventas,10275,MAGAA,1,1,26.93,Italia,1,Speedy Express
3,1,Davolio,Representante de ventas,10351,ERNSH,1,1,162.33,Austria,1,Speedy Express
4,1,Davolio,Representante de ventas,10364,EASTC,1,1,71.97,Reino Unido,1,Speedy Express